{
  "fat": 21.0,
  "description": "Make an elevated version of beans on toast using your favourite beans, plus tomatoes, garlic and chilli – they're great topped with cheese",
  "sugars": 10.0,
  "carbs": 58.0,
  "id": "11d02d4b-bae0-4e87-805a-e86e5dc3f216",
  "maincategory": "health",
  "url": "https://www.bbcgoodfood.com/recipes/turbo-beans-cheese-on-toast",
  "salt": 1.4,
  "serves": 4,
  "protein_score": 88.7725631768953,
  "ratings": 5,
  "dish_type": "High fibre breakfasts",
  "name": "Turbo beans & cheese on toast",
  "kcal": 554.0,
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/220413_TURBO_BEANS_AND_CHEESE_ON_TOAST_0049_2-3edc6ea.jpg",
  "vote_count": 5,
  "saturates": 9.0,
  "fibre": 15.0,
  "ingredients": [
    "2 tbsp  vegetable oil or other oil ",
    "1 large  onion, finely chopped ",
    "4 garlic cloves, finely chopped  ",
    "1 tsp  smoked paprika, plus extra for sprinkling ",
    "1 tsp ground cumin",
    "chipotle chilli paste,  to taste, or use chilli flakes (optional)",
    "200g can  chopped tomatoes or passata ",
    "2 x 400g cans  beans of your choice (kidney and cannellini work well), drained and rinsed",
    "4-8 slices crusty bread",
    "150g grated  cheddar "
  ],
  "subcategory": "Breakfast",
  "difficult": "Easy",
  "protein": 26.0,
  "steps": [
    "Heat the oil in a heavy-based frying pan over a medium heat and fry the onion for 8-10 mins until softened and slightly caramelised. Add the garlic and spices, the chipotle chilli paste or chilli flakes, if using, and some seasoning. Fry for a few minutes more until the mixture is fragrant.",
    "Add the tomatoes, then swirl out the pan using 100ml water and add this too. Simmer for 10-15 mins until the mixture has thickened. Blitz the sauce using a hand blender, then taste for seasoning. Tip in the beans and mix well to coat. Warm through over a medium heat for 5 mins until the beans are piping hot.",
    "Heat the grill to high and toast the bread slices for 3-5 mins. Top with the beans and grated cheese, and pop under the grill until the cheese is melted and bubbling. Sprinkle with a little paprika and serve immediately."
  ],
  "nutritional_score": 86,
  "author": "Claire Thomson",
  "times": { "Cooking": "35 mins", "Preparation": "7 mins" }
}
